Revit 2027 API
BuiltInFailures.MEPFabricationFailures.UneditableFabricationPartNotReposition Property
 Failed to reposition part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UneditableFabricationPartNotReposition { get; }
Public Shared ReadOnly Property UneditableFabricationPartNotReposition As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UneditableFabricationPartNotReposition {
	FailureDefinitionId^ get ();
}
static member UneditableFabricationPartNotReposition : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace